
mathima_1 = [[5, 5, 6, 6,
              7, 7, 8, 8,
              9, 9, 10, 10,
              11, 11, 12, 12,
              13, 13, 14, 14,
              15, 15, 16, 16,
              17, 17, 18, 18,
              19, 19, 20, 20,
              21, 21, 22, 22,
              23, 23, 24, 24,
              25, 25, 26, 26,
              27, 27, 28, 28,
              29, 29, 30, 30,
              31, 31, 32, 32,
              33, 33, 34, 34], [1, 2, 2, 2,
                                2, 3, 3, 3,
                                3, 4, 4, 4,
                                4, 5, 5, 5,
                                5, 6, 6, 6,
                                6, 7, 7, 7,
                                7, 8, 8, 8,
                                8, 9, 9, 9,
                                9, 10, 10, 10,
                                10, 11, 11, 11,
                                11, 12, 12, 12,
                                12, 13, 13, 13,
                                13, 14, 15, 16,
                                17, 17, 17, 18,
                                19, 19, 20, 20]]

mathima_2 = [[5, 5, 6, 6,
              7, 7, 8, 8,
              9, 9, 10, 10,
              11, 11, 12, 12,
              13, 13, 14, 14,
              15, 15, 16, 16,
              17, 17, 18, 18,
              19, 19, 20, 20,
              21, 21, 22, 22,
              23, 23, 24, 24,
              25, 25, 26, 26,
              27, 27, 28, 28,
              29, 29, 30, 30,
              31, 31, 32, 32,
              33, 33, 34, 34], [1, 2, 2, 2,
                                3, 2, 3, 3,
                                3, 4, 4, 4,
                                4, 5, 5, 5,
                                5, 6, 6, 6,
                                6, 7, 7, 7,
                                7, 8, 8, 8,
                                8, 9, 9, 9,
                                9, 10, 10, 10,
                                10, 11, 11, 11,
                                11, 12, 12, 12,
                                12, 13, 13, 13,
                                13, 14, 15, 16,
                                17, 17, 17, 18,
                                19, 19, 20, 20]]

mathima_3 = [[5, 5, 6, 6,
              7, 7, 8, 8,
              9, 9, 10, 10,
              11, 11, 12, 12,
              13, 13, 14, 14,
              15, 15, 16, 16,
              17, 17, 18, 18,
              19, 19, 20, 20,
              21, 21, 22, 22,
              23, 23, 24, 24,
              25, 25, 26, 26,
              27, 27, 28, 28,
              29, 29, 30, 30,
              31, 31, 32, 32,
              33, 33, 34, 34], [1, 2, 2, 2,
                                3, 2, 3, 3,
                                3, 4, 4, 4,
                                4, 5, 5, 5,
                                5, 6, 6, 6,
                                6, 7, 7, 7,
                                7, 8, 8, 8,
                                8, 9, 9, 9,
                                9, 10, 10, 10,
                                10, 11, 11, 11,
                                11, 12, 12, 12,
                                12, 13, 13, 13,
                                13, 14, 15, 16,
                                17, 17, 17, 18,
                                19, 19, 20, 20]]

mathima_4 = [[5, 5, 6, 6,
              7, 7, 8, 8,
              9, 9, 10, 10,
              11, 11, 12, 12,
              13, 13, 14, 14,
              15, 15, 16, 16,
              17, 17, 18, 18,
              19, 19, 20, 20,
              21, 21, 22, 22,
              23, 23, 24, 24,
              25, 25, 26, 26,
              27, 27, 28, 28,
              29, 29, 30, 30,
              31, 31, 32, 32,
              33, 33, 34, 34], [1, 2, 2, 2,
                                3, 2, 3, 3,
                                3, 4, 4, 4,
                                4, 5, 5, 5,
                                5, 6, 6, 6,
                                6, 7, 7, 7,
                                7, 8, 8, 8,
                                8, 9, 9, 9,
                                9, 10, 10, 10,
                                10, 11, 11, 11,
                                11, 12, 12, 12,
                                12, 13, 13, 13,
                                13, 14, 15, 16,
                                17, 17, 17, 18,
                                18, 19, 19, 20]]

print("Εισάγετε τις ώρες διαβάσματος ανά εβδομάδα με έναν θετικό ακέραιο αριθμό.")

while True:
    try:
        hours_1 = int(input("Πόσες ώρες διαβάζεις την εβδομάδα το μάθημα 1; "))
        if  hours_1 >= 0:
            if 0 <= hours_1 < 5:
                print("Ούπς! Θα γράψεις 0 :(")
                total1=0
                break

            elif hours_1 >= 35:
                print("Ουάου! Πας για 20άρι!")
                total1 = 20
                break
            else:
                total = 0
                counter = 0
                for i in range(len(mathima_1[0])):
                    if mathima_1[0][i] == hours_1:
                        counter += 1
                        total += mathima_1[1][i]
                print("Προβλέπω οτι θα γράψεις {:.3f}!".format(total / counter))
                total1 = total / counter
                break
        else:
            print("Πρέπει να δώσεις θετικό ακέραιο...")
    except:
        print("Πρέπει να δώσεις θετικό ακέραιο...")

print()

while True:
    try:
        hours_2 = int(input("Πόσες ώρες διαβάζεις την εβδομάδα το μάθημα 2; "))
        if hours_2>=0:
            if 0 <= hours_2 < 5:
                print("Ούπς! Θα γράψεις 0 :(")
                total2 = 0
                break
            elif hours_2 >= 35:
                print("Ουάου! Πας για 20άρι!")
                total2 = 20
                break
            else:
                total = 0
                counter = 0
                for i in range(len(mathima_2[0])):
                    if mathima_2[0][i] == hours_2:
                        counter += 1
                        total += mathima_2[1][i]
                print("Προβλέπω οτι θα γράψεις {:.3f}!".format(total / counter))
                total2 = total / counter
                break

        else:
            print("Πρέπει να δώσεις θετικό ακέραιο...")
    except:
        print("Πρέπει να δώσεις θετικό ακέραιο...")

print()

while True:
    try:
        hours_3 = int(input("Πόσες ώρες διαβάζεις την εβδομάδα το μάθημα 3; "))
        if hours_3>=0:
            if 0 <= hours_3 < 5:
                print("Ούπς! Θα γράψεις 0 :(")
                total3 = 0
                break
            elif hours_3 >= 35:
                print("Ουάου! Πας για 20άρι!")
                total3 = 20
                break
            else:
                total = 0
                counter = 0
                for i in range(len(mathima_3[0])):
                    if mathima_3[0][i] == hours_3:
                        counter += 1
                        total += mathima_3[1][i]
                print("Προβλέπω οτι θα γράψεις {:.3f}!".format(total / counter))
                total3 = total / counter
                break
        else:
            print("Πρέπει να δώσεις θετικό ακέραιο...")
    except:
        print("Πρέπει να δώσεις θετικό ακέραιο...")

while True:
    try:
        hours_4 = int(input("Πόσες ώρες διαβάζεις την εβδομάδα το μάθημα 4; "))
        if hours_4>=0:
            if 5 > hours_4 >= 0:
                print("Ούπς! Θα γράψεις 0 :(")
                total4 = 0
                break
            elif hours_4 >= 35:
                print("Ουάου! Πας για 20άρι!")
                total4 = 20
                break
            else:
                total = 0
                counter = 0
                for i in range(len(mathima_4[0])):
                    if mathima_4[0][i] == hours_4:
                        counter += 1
                        total += mathima_4[1][i]
                print("Προβλέπω οτι θα γράψεις {:.3f}!".format(total / counter))
                total4 = total / counter
                break
        else:
            print("Πρέπει να δώσεις θετικό ακέραιο...")

    except:
        print("Πρέπει να δώσεις θετικό ακέραιο...")

print()

print("Τελικός βαθμός: {:.3f}".format((total1 + total2 + total3 + total4) / 4))
